*Pandas*
1.String IO
2.Pandas read_csv

In [1]:
from io import StringIO

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('data.csv')

In [4]:
df

        S.Dey  24  19
0  M.Banerjee   7  20
1      S.Pati  44  20
2       M.Dey  23  20
3     P.Lorem  45  67

In [5]:
df.head()

        S.Dey  24  19
0  M.Banerjee   7  20
1      S.Pati  44  20
2       M.Dey  23  20
3     P.Lorem  45  67

In [6]:
df

        S.Dey  24  19
0  M.Banerjee   7  20
1      S.Pati  44  20
2       M.Dey  23  20
3     P.Lorem  45  67

In [7]:
df

        S.Dey  24  19
0  M.Banerjee   7  20
1      S.Pati  44  20
2       M.Dey  23  20
3     P.Lorem  45  67

In [8]:
df=pd.read_csv('data.csv')
df

        S.Dey  24  19
0  M.Banerjee   7  20
1      S.Pati  44  20
2       M.Dey  23  20
3     P.Lorem  45  67

In [26]:
data=('Col1,Col2,Col3\n'
      'x,y,3\n'
      'a,b,2\n'
     'x,y,4')

In [27]:
df=pd.read_csv(StringIO(data))

In [28]:
df

  Col1 Col2  Col3
0    x    y     3
1    a    b     2
2    x    y     4

In [29]:
df=pd.read_csv(StringIO(data),usecols=['Col1','Col3'])

In [30]:
df

  Col1  Col3
0    x     3
1    a     2
2    x     4

In [16]:
df.to_csv('text.csv',index=False)

In [17]:
data=('a,b,c,d\n'
        '1,2,3,4\n'
        '5,6,7,8\n'
        '9,10,11,12')

In [18]:
df=pd.read_csv(StringIO(data))
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
dtypes: int64(4)
memory usage: 228.0 bytes

In [20]:
df=pd.read_csv(StringIO(data),dtype=object)
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       3 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [22]:
data=('a,b,c,d\n'
        '1,2,3,4\n'
        '5,6,7,8\n'
        '9,10,11,12')

In [25]:
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':int})

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      float64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 228.0 bytes

In [4]:
pd.read_csv('new.csv')

   Employe Unnamed: 1           Unnamed: 2
0     Name        Age                Email
1     John         25     john@example.com
2    Alice         30    alice@example.com
3      Bob         28      bob@example.com
4    Emily         22    emily@example.com
5  Michael         35  michael@example.com
6   Sophia         27   sophia@example.com